{
  "IEGtoPEO": {
    "IEG1": ["PEO1"],
    "IEG2": ["PEO2"],
    "IEG3": ["PEO3"],
    "IEG4": ["PEO4"],
    "IEG5": ["PEO5"]
  },

  "PEOtoPLO": {
    "PEO1": ["PLO1", "PLO2", "PLO3", "PLO6", "PLO7"],
    "PEO2": ["PLO11"],
    "PEO3": ["PLO10", "PLO9"],
    "PEO4": ["PLO5"],
    "PEO5": ["PLO8", "PLO4", "PLO9"]
  },

  "PLOstatements": {
    "Diploma": {
      "PLO1": "Demonstrate foundational knowledge and understanding of basic concepts, principles, and practices in the discipline responsibly.",
      "PLO2": "Apply basic critical and logical thinking to identify and solve routine problems ethically.",
      "PLO3": "Perform simple practical or technical tasks safely and responsibly under supervision.",
      "PLO4": "Demonstrate teamwork, empathy, and respectful interaction in supervised group settings.",
      "PLO5": "Communicate simple ideas clearly and respectfully in written, oral, and digital forms.",
      "PLO6": "Use common digital tools and technologies safely and responsibly for basic tasks.",
      "PLO7": "Apply basic mathematical or numerical techniques accurately and honestly.",
      "PLO8": "Demonstrate initiative and responsibility in supervised tasks or group activities.",
      "PLO9": "Demonstrate self-management, discipline, and a positive attitude toward personal growth.",
      "PLO10": "Show basic creativity and responsibility in identifying simple opportunities or improvements.",
      "PLO11": "Demonstrate awareness of ethical behaviour, honesty, and responsible conduct."
    },

    "Degree": {
      "PLO1": "Apply comprehensive disciplinary knowledge and theoretical understanding responsibly in professional contexts.",
      "PLO2": "Use critical, analytical, and creative thinking to solve moderately complex problems ethically.",
      "PLO3": "Perform technical, practical, or clinical procedures competently and safely according to professional standards.",
      "PLO4": "Demonstrate effective teamwork, empathy, respect, and constructive interpersonal communication.",
      "PLO5": "Communicate effectively and respectfully to diverse audiences using appropriate written, oral, and digital methods.",
      "PLO6": "Use digital tools and technologies responsibly, ethically, and effectively to support professional tasks.",
      "PLO7": "Apply quantitative reasoning and statistical techniques accurately and accountably in problem solving.",
      "PLO8": "Demonstrate leadership, responsibility, and positive influence in completing tasks or managing small groups.",
      "PLO9": "Demonstrate self-regulation, resilience, professionalism, and commitment to lifelong learning.",
      "PLO10": "Demonstrate entrepreneurial thinking, creativity, and initiative guided by social responsibility.",
      "PLO11": "Apply ethical principles, integrity, and professional values in decision-making and practice."
    },

    "Master": {
      "PLO1": "Integrate advanced knowledge and specialised understanding to address complex disciplinary or interdisciplinary challenges.",
      "PLO2": "Apply advanced analytical, critical, and reflective thinking to propose ethical and effective solutions.",
      "PLO3": "Execute advanced technical, practical, or clinical procedures with high proficiency and professional responsibility.",
      "PLO4": "Demonstrate advanced interpersonal skills, empathy, and collaboration in professional or multidisciplinary environments.",
      "PLO5": "Communicate complex ideas clearly, persuasively, and respectfully to expert and non-expert audiences.",
      "PLO6": "Use advanced digital tools, technologies, and data ethically and effectively for professional or research purposes.",
      "PLO7": "Apply advanced quantitative, analytical, or modelling techniques with precision and accountability.",
      "PLO8": "Demonstrate leadership, initiative, and ethical influence in managing complex tasks or teams.",
      "PLO9": "Demonstrate autonomy, resilience, professionalism, and commitment to continuous personal and professional development.",
      "PLO10": "Create or evaluate innovative, responsible, and sustainable solutions to complex challenges or opportunities.",
      "PLO11": "Demonstrate advanced ethical reasoning, integrity, and professional judgement in complex situations."
    },

    "PhD": {
      "PLO1": "Generate new knowledge through systematic investigation and demonstrate authoritative understanding of disciplinary or interdisciplinary fields.",
      "PLO2": "Critically analyse, synthesise, and evaluate complex ideas to create innovative and ethical solutions or theoretical contributions.",
      "PLO3": "Perform specialised or novel practical, technical, or research procedures with high autonomy and scholarly rigour.",
      "PLO4": "Demonstrate advanced interpersonal, collaborative, and empathetic engagement in international or multidisciplinary contexts.",
      "PLO5": "Communicate complex research findings or expert knowledge effectively, respectfully, and persuasively at international standards.",
      "PLO6": "Use advanced digital technologies, data analytics, and research tools ethically and proficiently in generating new knowledge.",
      "PLO7": "Apply sophisticated quantitative, statistical, or modelling techniques accurately, transparently, and with scholarly accountability.",
      "PLO8": "Provide intellectual, ethical, and strategic leadership in disciplinary or professional domains.",
      "PLO9": "Demonstrate intellectual independence, resilience, professionalism, and lifelong scholarly commitment.",
      "PLO10": "Create or lead innovative, responsible, and sustainable ventures or solutions with societal or global impact.",
      "PLO11": "Demonstrate the highest standards of ethics, integrity, responsible conduct, and scholarly stewardship."
    }
  },

  "SCmapping": {
    "PLO1": "SC1.1 Subject Knowledge, SC1.2 Conceptual Understanding",
    "PLO2": "SC2.1 Analysis, SC2.2 Evaluation, SC2.3 Problem-Solving",
    "PLO3": "SC3.1 Technical Skills, SC3.2 Safety Practice",
    "PLO4": "SC4.1 Empathy, SC4.2 Team Interaction",
    "PLO5": "SC5.1 Oral, SC5.2 Written, SC5.3 Digital Communication",
    "PLO6": "SC6.1 Digital Tools, SC6.2 Data Handling",
    "PLO7": "SC7.1 Calculation, SC7.2 Interpretation",
    "PLO8": "SC8.1 Leadership, SC8.2 Responsibility",
    "PLO9": "SC9.1 Self-management, SC9.2 Professionalism",
    "PLO10": "SC10.1 Creativity, SC10.2 Opportunity Recognition",
    "PLO11": "SC11.1 Ethics, SC11.2 Integrity"
  },

  "PLOtoVBE": {
    "PLO1": "Professional Integrity",
    "PLO2": "Critical & Reflective Thinking",
    "PLO3": "Professional Conduct",
    "PLO4": "Humanity & Compassion",
    "PLO5": "Respectful Communication",
    "PLO6": "Digital Responsibility",
    "PLO7": "Accuracy & Accountability",
    "PLO8": "Leadership & Stewardship",
    "PLO9": "Self-Awareness & Wellbeing",
    "PLO10": "Innovation & Social Responsibility",
    "PLO11": "Ethical & Moral Reasoning"
  },

  "PLOIndicators": {
    "PLO1": "≥70% knowledge assessment score",
    "PLO2": "≥3/5 problem-solving rubric",
    "PLO3": "≥80% technical/practical competency",
    "PLO4": "≥3/5 teamwork/interpersonal rubric",
    "PLO5": "≥70% communication rubric score",
    "PLO6": "≥3/5 digital skills rubric score",
    "PLO7": "≥70% accuracy in numeracy/statistics tasks",
    "PLO8": "≥3/5 leadership rubric",
    "PLO9": "≥3/5 professionalism/self-management rubric",
    "PLO10": "≥3/5 entrepreneurship/innovation rubric",
    "PLO11": "100% compliance with ethics checklist"
  }
}
